app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title_name", "author_type", "blog_body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title_name", "ass"], ["author_type", nil], ["blog_body", "dsf"], ["user_id", 1], ["created_at", "2022-12-18 11:58:11.777019"], ["updated_at", "2022-12-18 11:58:11.777019"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "blog_body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["blog_body", "sssfdfsd"], ["updated_at", "2022-12-18 12:34:31.192587"], ["id", 3]]